import pytest
import platform


# --------------------------------------------------------------------------------------------------------------------
# --------------------------------------------------------------------------------------------------------------------
#                             Здесь расположим наши фиктусры
# --------------------------------------------------------------------------------------------------------------------
# --------------------------------------------------------------------------------------------------------------------


@pytest.fixture
def run_up_server_tcp():
    from RunUpServer.Run_Up_Server import RunUpServer
    # Подымаем сервер
    ServerSettings = RunUpServer(rtu327=False, iface1=True, iface2=True, iface3=False, iface4=True)
    print('Сервер Подняли...')
    return ServerSettings
